### DataFrame 
+ 파이썬에서 데이터를 분석할 때 사용하는 객체
+ DataFrame 객체 사용을 위해서는 pandas 라이브러리 import

###### DataFrame을 적용할 데이터

In [13]:
data={
    '이름': ['김자바', '이자바', '박자바', '최캐드','정캐드'],
    '학급' : ['자바반', '자바반','자바반', '캐드반','캐드반'],
    '국어점수': [90,80,70,100,90],
    '영어점수':[70,80,80,70,90],
    '평균': [80.0,80.0,85.0,85.0,90.0],
    '취미': ['독서', '','','요가', '축구']
}

In [2]:
data['국어점수'][1]

80


###### DataFrame 객체 생성
+ dictionary 데이터를 DataFrame 형태로 변화시켜 데이터 분석 실시
+ 데이터 분석 및 DataFrmae객체 사용을 위해서는 pandas 라이브러리 import
+ pandas 라이브러리 import 문법: import pandas as pd 
+ dictionary 데이터를 DataFrame으로 변환: pd.DataFrame(딕셔너리 데이터)

In [5]:
# 최초에 한 번은 pandas 라이브러리를 pc에 설치
# 터미널에서 pip install pandas 명령어 실행

In [4]:
# 판다스 라이브러리 임폴트
import pandas as pd

In [7]:
# 딕셔너리 데이터를 데이터 프레임 형태로 변환
df = pd.DataFrame(data)
df

    이름   학급  국어점수  영어점수    평균  취미
0  김자바  자바반    90    70  80.0  독서
1  이자바  자바반    80    80  80.0
2  박자바  자바반    70    80  85.0
3  최캐드  캐드반   100    70  85.0  요가
4  정캐드  캐드반    90    90  90.0  축구

### DataFrame에서 데이터 조회 기본

In [15]:
#  하나의 컬럼의 값을 모두 조회
df[' 이름']

0    김자바
1    이자바
2    박자바
3    최캐드
4    정캐드
Name:  이름, dtype: object

In [16]:
# 두 개 이상의 컬럼의 모든 값 조회
df[[' 이름', '학급']]

    이름   학급
0  김자바  자바반
1  이자바  자바반
2  박자바  자바반
3  최캐드  캐드반
4  정캐드  캐드반

In [22]:
# 팁: 데이터 프레임을 엑셀파일을 만드는 방법
df.to_excel('test1.xlsx',index=False)

In [21]:
# 엑셀 파일을 데이터프레임으로 가져오기
new_df=pd.read_excel('test.xlsx')
new_df

    이름   학급  국어점수  영어점수  평균   취미
0  김자바  자바반    90    70  80   독서
1  이자바  자바반    80    80  80  NaN
2  박자바  자바반    70    80  85  NaN
3  최캐드  캐드반   100    70  85   요가
4  정캐드  캐드반    90    90  90   축구

In [23]:
# 딕셔너리 데이터를 데이터 프레임으로 변환 시 index 지정
df = pd.DataFrame(data, index=['1번','2번','3번','4번','5번'])
df

     이름   학급  국어점수  영어점수    평균  취미
1번  김자바  자바반    90    70  80.0  독서
2번  이자바  자바반    80    80  80.0
3번  박자바  자바반    70    80  85.0
4번  최캐드  캐드반   100    70  85.0  요가
5번  정캐드  캐드반    90    90  90.0  축구

In [25]:
# 딕셔너리 데이터를 데이터프레임으로 변환 시 필요한 값만 가져오기
df = pd.DataFrame(data, columns=['이름','학급','국어점수','영어점수'])
df

    이름   학급  국어점수  영어점수
0  김자바  자바반    90    70
1  이자바  자바반    80    80
2  박자바  자바반    70    80
3  최캐드  캐드반   100    70
4  정캐드  캐드반    90    90

In [26]:
movie_data = {
    '영화' : ['명량', '극한직업', '신과함께-죄와 벌', '국제시장', '괴물', '도둑들', '7번방의 선물', '암살'],
    '개봉 연도' : [2014, 2019, 2017, 2014, 2006, 2012, 2013, 2015],
    '관객 수' : [1761, 1626, 1441, 1426, 1301, 1298, 1281, 1270], # (단위 : 만 명)
    '평점' : [8.88, 9.20, 8.73, 9.16, 8.62, 7.64, 8.83, 9.10]
}

In [27]:
# 문제1. 위의 데이터를 활용하여 아래 조건에 맞게 DataFrame을 만드세요. 
# 데이터 중 영화, 개봉, 연도, 평점에 대한 데이터를 
# DateFrame으로 만든다
# DateFrame의 index는 '1번','2번' 형태로 만든다 
# 이렇게 만들어진 framedata를 movie.xlsx의 엑셀 파일로 변환

In [31]:
move=pd.DataFrame(movie_data,columns=['영화','개봉 연도','평점'])
move

          영화  개봉 연도    평점
0         명량   2014  8.88
1       극한직업   2019  9.20
2  신과함께-죄와 벌   2017  8.73
3       국제시장   2014  9.16
4         괴물   2006  8.62
5        도둑들   2012  7.64
6    7번방의 선물   2013  8.83
7         암살   2015  9.10

In [42]:
col=['영화','개봉 연도','평점']

idx=[]
data_length=len(movie_data['영화'])
for i in range(1,data_length+1):
    df_index = str(i)+ '번'
    idx.append(df_index)
idx



move= pd.DataFrame(movie_data,columns=col,index=idx)
move
move.to_excel('movie.xlsx')